nc: 80           # number of classes
scale: n
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# -------------------- Backbone --------------------
backbone:
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 2, C3k2, [128, False, 0.5]]

  - [-1, 1, MultiScaleEdgeInfoGenetator, [[64,128,256]]]
  - [3, 1, GetIndexOutput, [0]]
  - [3, 1, GetIndexOutput, [1]]
  - [3, 1, GetIndexOutput, [2]]

  - [2, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.5]]
  - [[4, -1], 1, ConvEdgeFusion, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [256, True, 0.5]]
  - [[5, -1], 1, ConvEdgeFusion, [256]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True, 0.5]]
  - [[6, -1], 1, ConvEdgeFusion, [512]]

  - [-1, 1, SPPF, [512, 5]]
  - [-1, 2, C2PSA, [512]]

# -------------------- Head --------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False, 0.5]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False, 0.5]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True, 0.5]]

  - [[9, 23], 1, HAFB, [128, True]]
  - [[12, 26], 1, HAFB, [256, False]]
  - [[17, 29], 1, HAFB, [512, False]]

  - [[30, 31, 32], 1, Detect_MultiSEAM, [nc]]
